blog/model.protoverse.project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-12-05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modeling The Computational Universe</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Creating a synthetic universe from scratch" />
<meta name="keywords" content="philosophical modeling, computational metaphysics, computational philosophy, process philosophy, artificial universe" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; font-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Cormorant:wght@300&family=Gentium+Plus:ital,wght@0,400;0,700;1,400;1,700&family=PT+Sans+Caption:wght@400;700&family=PT+Sans+Narrow:wght@400;700&family=PT+Sans:ital,wght@0,400;0,700;1,400;1,700&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/model.protoverse.project.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="index" href="/index.html">Index</a><a id="bio" href="/bio.html">Bio</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2025-12-05">Last updated: 2025-12-05</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Modeling The Computational Universe</h1>
<p class="subtitle" role="doc-subtitle">Protoverse: Computational Model</p>
</header><nav class="pager" id="org97aee78">
<p>
This is part of the Protoverse project:<br>
</p>
<ul class="org-ul">
<li><a href="introduction.protoverse.project.html">Introduction</a><br></li>
<li><a href="metaphysics.protoverse.project.html">Metaphysics</a><br></li>
<li><a href="engineering.protoverse.project.html">Technical Considerations</a><br></li>
<li><a href="resources.protoverse.project.html">Resources</a><br></li>
<li><b><a href="model.protoverse.project.html">Computational Model</a></b><br></li>
<li><a href="ethics.protoverse.project.html">Ethical Guidelines</a><br></li>
</ul>
</nav>

<div class="message" id="org4417126">
<p>
NOT STARTED YET &#x2013; I&rsquo;m going to work on the model after the metaphysical framework is done. If you would like to ponder ideas, I&rsquo;ll be glad for your input. You will find the <a href="https://github.com/monkeyjunglejuice/protoverse">source code on Github</a><br>
</p>

</div>

<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcc1323e">Synchronization / Desynchronization</a></li>
<li><a href="#orgde25cce">The Abstract Process</a>
<ul>
<li><a href="#org24745a3">Interaction Dynamics</a>
<ul>
<li><a href="#orgdbffc4f">Ideas for the Initial Epistemological Scope of Primitive Processes</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-orgcc1323e" class="outline-2">
<h2 id="orgcc1323e"><a href="#orgcc1323e">Synchronization / Desynchronization</a></h2>
<div class="outline-text-2" id="text-orgcc1323e">
<p>
One of the worries and challenges when it comes to concurrent and/or parallel computation is the synchronization of outcomes. I read quite often about simulations progressing in &ldquo;ticks&rdquo; &#x2013; &ldquo;rendering the world&rdquo; in discrete steps. I don&rsquo;t know if that is really common practice or just in toy-like simulations and cellular automata, but this idea has to be abandoned.<br>
</p>

<p>
Why? Well first, the Protoverse isn&rsquo;t supposed to be a &ldquo;simulation&rdquo; to begin with, but the instatiation of an abstract model. It&rsquo;s not going to simulate <i>something else</i> &#x2013; but will be &ldquo;the real thing&rdquo; itself.<br>
</p>

<p>
And if we&rsquo;re being honest (and assume that relativity is a thing), then we must acknowledge there&rsquo;s no real synchronization in our universe either &#x2013; it just an illusion of our daily experience (low-speed local human experience plus our limited spatial scale). Just a simple example: There is no &ldquo;at this moment&rdquo; on the moon while you&rsquo;re on Earth. The striving, longing for synchronization is real, no doubt &#x2013; but can never be reached. Maybe that nurtures our obsession with synchronicity.<br>
</p>

<p>
Ok to sum it up: global time doesn&rsquo;t exist in reality and wouldn&rsquo;t make sense in the Protoverse either; it violates the process-relational Protoverse metaphysics (no background time, no background space &#x2013; these are emergent phenomena), and regarding efficient computation, synchronous progression is probably the worst possible decision, as it kills parallelization and scaling. Maybe the universe is so efficient because it&rsquo;s inherently asynchronous.<br>
</p>

<p>
Ok, that out of the way &#x2013; what does it mean for our model?<br>
</p>
<ul class="org-ul">
<li>Only partial orders, not total orders<br></li>
<li>Causality becomes the foundation of consistency<br></li>
<li>&ldquo;Synchronize&rdquo; only what actually interacts<br></li>
<li>Everything else remains decoupled and can run in parallel<br></li>
</ul>
</div>
</div>
<div id="outline-container-orgde25cce" class="outline-2">
<h2 id="orgde25cce"><a href="#orgde25cce">The Abstract Process</a></h2>
<div class="outline-text-2" id="text-orgde25cce">
<p>
<i>This is about <a href="metaphysics.protoverse.project.html">Process (metaphysics</a>); not to confuse with process or thread (computation).</i><br>
</p>

<p>
The Process abstraction is prior, and it&rsquo;s the only truly scale-invariant principle. Processes do not exist <i>within</i> an environment or within space or time &#x2013; instead, the relational dynamics of processes bring about perceived structures and dimensions, as they continuously <i>become</i> their environment, actively co-creating (resp. co-evolving) the substrate they are operating in.<br>
</p>
</div>
<div id="outline-container-org24745a3" class="outline-3">
<h3 id="org24745a3"><a href="#org24745a3">Interaction Dynamics</a></h3>
<div class="outline-text-3" id="text-org24745a3">
</div>
<div id="outline-container-orgdbffc4f" class="outline-4">
<h4 id="orgdbffc4f"><a href="#orgdbffc4f">Ideas for the Initial Epistemological Scope of Primitive Processes</a></h4>
<div class="outline-text-4" id="text-orgdbffc4f">
<p>
As Processes evolve and emerge higher-order Processes, it&rsquo;s reasonable to assume that the interactions could become more complex, transcending this initial scope. Some crude ideas:<br>
</p>
</div>
<div id="outline-container-orga861c0f" class="outline-5">
<h5 id="orga861c0f"><a href="#orga861c0f">1. Idea: Lexical Scope and Black Boxes</a></h5>
<div class="outline-text-5" id="text-orga861c0f">
<p>
There are no isolated Processes (&ldquo;closed systems&rdquo;), but a Process <code>P</code> cannot fully access the state of an arbitrary Process <code>Q</code> it interacts with. The arbitrary Process <code>Q</code> can initially only be understood in terms of a blackbox and successively modelling thereof, and interacted with according to the interfaces the Process <code>Q</code> exposes. Interfaces may adapt through ongoing interaction.<br>
</p>

<p>
The interaction <code>P ∧ Q</code> leads to an aggregate Processes (higher-order Process) <code>PQ</code>.<br>
</p>

<p>
This interaction between both might also create or alter sub-Processes <code>Px</code> and <code>Qx</code> within the boundaries of <code>P'</code> and <code>Q'</code>. The sub-processes <code>P'.X</code> and <code>Q'.X</code> can be fully accessed only by their respective super-Processes, while they cannot fully access the state of their super-Processes <code>P'</code> and <code>Q'</code> (same as the initial situation); hence <code>P.X</code> and <code>Q.X</code> need to reseort to black box analysis. While doing so, they have to create an inner model <code>P.X.Y</code> and <code>Q.X.Y</code>, and that would lead to an infinite regress, but not if each inner, newly spawned sub-Process is always a primitive Process.<br>
</p>

<p>
However, it is unclear yet how far the access to newly initiated sub-Processes <code>P.X</code> reaches, and under what circumstances, and if or to which extent the super-Process <code>P'</code> gradually loose access to these newly emerged child Processes, e.g. <code>P.X</code>, <code>P.X.Z</code>, etc.<br>
</p>

<p>
Maybe the access decays, the more interactions the evolved Processes <code>P'</code> and <code>Q'</code> experience (more relations piling up in their interaction logs) without further involvement of the child Processes <code>Xn</code>? Also, access from parent Processes to child Process may decay the more independent interactions the child Processes experience; the &ldquo;further away&rdquo; they get?<br>
</p>
</div>
</div>
<div id="outline-container-org48268ea" class="outline-5">
<h5 id="org48268ea"><a href="#org48268ea">2. Idea:</a></h5>
<div class="outline-text-5" id="text-org48268ea">
<p>
&#x2026;..<br>
</p>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
